scrat.org
* reading time estimative
#+PROPERTY: header-args :tangle scrat.el
** o que está faltando
*** colocar os domínios das funções
*** arrumar as docstrings
*** colocar um esquema para marcar com o org-noter
** variáveis capítulos
#+begin_src emacs-lisp
(setq skip-start-chapters '("Cover" "Title Page" "Copyright"
							"Dedication" "About The Author"
							"Foreword" "Preface" "Contents"))

(setq skip-end-chapters '("References" "Index"))
#+end_src

#+RESULTS:
| References | Index |

** variáveis com configurações

#+begin_src emacs-lisp
;; default do máximo que ele vai pra dentro no índice
(setq max-depth 1)
#+end_src

#+RESULTS:
: 1

** pega as variáveis dos pdfs
;; TODO certificar que está num modo pdf
;; nesta função e na get-outline

;; roda essa função no modo de pdf
;; TODO checa se existe outline

#+begin_src emacs-lisp
(defun get-total-pages ()
  (interactive)
  (progn (define-pdf-cache-function number-of-pages)
		 (setq number-of-pages (pdf-cache-number-of-pages))))

(defun get-outline ()
  (interactive)
  (progn (define-pdf-cache-function outline)
		 (setq outline (pdf-cache-outline))))
#+end_src

#+RESULTS:
: get-outline

** outline parse

#+begin_src emacs-lisp
(defun teste (outline)
  "função que pega uma entrada do outline e retorna o nome e o número da página"
  ;; TODO checar se está de acordo com o default em depth
  (if (<= (cdr (assoc 'depth outline)) max-depth)
	  ;; check membership in chapters
	  ;; TODO tirar os end chapters e analisar só até a primeira entrada
	  (if (not (member (cdr (assoc 'title outline))
					   (append skip-start-chapters skip-end-chapters)))
		  ;; return values
		  (list (cdr (assoc 'title outline))
				(cdr (assoc 'page outline)))
		;; TODO arrumar isso daqui e pensar num jeito melhor pra ver isso
		;; acho que chegar o end chapters seria uma boa
		"fim")))
#+end_src

#+RESULTS:
: teste

*** teste
#+begin_src emacs-lisp :tangle no
(teste (nth 8 outline))
(teste (nth 9 outline))
#+end_src

#+RESULTS:

*** arruma isso

#+begin_src emacs-lisp :tangle no
;; TODO ajeitar isso
(setq outlineum (mapcar #'teste outline))
(setq outlineum (remove nil (mapcar #'teste outline)))
(setq outlineum (remove "fim" outlineum))
#+end_src

#+RESULTS:
| Chapter 1 - Introduction To Cognitive Behavior Therapy      |  23 |
| Chapter 2 - Overview Of Treatment                           |  39 |
| Chapter 3 - Cognitive Conceptualization                     |  51 |
| Chapter 4 - The Evaluation Session                          |  68 |
| Chapter 5 - Structure Of The First Therapy Session          |  81 |
| Chapter 6 - Behavioral Activation                           | 102 |
| Chapter 7 - Session 2 And Beyond: Structure And Format      | 122 |
| Chapter 8 - Problems With Structuring The Therapy Session   | 145 |
| Chapter 9 - Identifying Automatic Thoughts                  | 159 |
| Chapter 10 - Identifying Emotions                           | 180 |
| Chapter 11 - Evaluating Automatic Thoughts                  | 189 |
| Chapter 12 - Responding To Automatic Thoughts               | 209 |
| Chapter 13 - Identifying And Modifying Intermediate Beliefs | 220 |
| Chapter 14 - Identifying And Modifying Core Beliefs         | 250 |
| Chapter 15 - Additional Cognitive And Behavioral Techniques | 278 |
| Chapter 16 - Imagery                                        | 299 |
| Chapter 17 - Homework                                       | 316 |
| Chapter 18 - Termination And Relapse Prevention             | 338 |
| Chapter 19 - Treatment Planning                             | 354 |
| Chapter 20 - Problems In Therapy                            | 368 |
| Chapter 21 - Progressing As A Cognitive Behavior Therapist  | 380 |

** pega o total de páginas por capítulo

#+begin_src emacs-lisp
;; TODO get pages and subtract get the total per chapter
(defun get-total-per-chapter (outl acc)
  "get pages and subtract to get the total per chapter"
  (if (= 0 (length outl))
	  acc
	(get-total-per-chapter (cdr-safe outl)
						   (cons (list (car (car outl))
									   (- (if (cdr-safe outl)
											  (car (cdr (car (cdr outl)))) ;; next element page number
															number-of-pages)
										  (car (cdr (car outl))))) ;; first element page number
								 acc))))
#+end_src

#+RESULTS:
: get-total-per-chapter

*** seq

#+begin_src emacs-lisp
(setq outlinedois (reverse (get-total-per-chapter outlineum '())))
#+end_src

#+RESULTS:
| Chapter 1 - Introduction To Cognitive Behavior Therapy      | 16 |
| Chapter 2 - Overview Of Treatment                           | 12 |
| Chapter 3 - Cognitive Conceptualization                     | 17 |
| Chapter 4 - The Evaluation Session                          | 13 |
| Chapter 5 - Structure Of The First Therapy Session          | 21 |
| Chapter 6 - Behavioral Activation                           | 20 |
| Chapter 7 - Session 2 And Beyond: Structure And Format      | 23 |
| Chapter 8 - Problems With Structuring The Therapy Session   | 14 |
| Chapter 9 - Identifying Automatic Thoughts                  | 21 |
| Chapter 10 - Identifying Emotions                           |  9 |
| Chapter 11 - Evaluating Automatic Thoughts                  | 20 |
| Chapter 12 - Responding To Automatic Thoughts               | 11 |
| Chapter 13 - Identifying And Modifying Intermediate Beliefs | 30 |
| Chapter 14 - Identifying And Modifying Core Beliefs         | 28 |
| Chapter 15 - Additional Cognitive And Behavioral Techniques | 21 |
| Chapter 16 - Imagery                                        | 17 |
| Chapter 17 - Homework                                       | 22 |
| Chapter 18 - Termination And Relapse Prevention             | 16 |
| Chapter 19 - Treatment Planning                             | 14 |
| Chapter 20 - Problems In Therapy                            | 12 |
| Chapter 21 - Progressing As A Cognitive Behavior Therapist  | 34 |

** PRA FAZER pega o tempo das coisas
#+begin_src emacs-lisp
;TODO: colocar um hook pra quando abrir o arquivo pdf ele pegar o tempo
(add-hook 'pdf-view-mode-hook #'set-pdf-time-before)

(defun set-pdf-time-before ()
  (setq pdf-time-before (current-time)))

(setq threshold 6)

(setq total-time 0)

(setq pdf-time-pages '())

(setq page-rate 1)

(length pdf-time-pages)

(defun pdf-check-page-advance ()
  (interactive)
  "checks if we are going forward on non-read pages"
;;  TODO vai bugar, depois preciso ver alguma solução melhor pra isso
  (add-to-list 'pdf-time-pages (1- (pdf-view-current-page))))

(defun testesss ()
  (let ((seconds-in-previous-page (time-to-seconds (time-subtract (current-time) pdf-time-before))))
	(progn (if (> seconds-in-previous-page threshold)
			   (progn (pdf-check-page-advance)
					  (setq total-time (+ total-time seconds-in-previous-page)
							page-rate (/ total-time (length pdf-time-pages)))
					  (message (format "%f total time and %f average page time" total-time page-rate))))
		   (setq pdf-time-before (current-time)))))

(add-hook 'pdf-view-after-change-page-hook #'testesss)

;; TODO uma função que checa se avançamos nas páginas

;; TODO uma outra função que estima o tempo final
;; TODO uma função que pega a última página como algo arbitrário para remover índices no final
#+end_src

#+RESULTS:
: 3

** aplica o tempo nos capítulo

#+begin_src emacs-lisp
(defun get-chapters-time (outline)
  "Function that gets the OUTLINE rate and apply it to the time."
  (list (car outline)
		(* page-rate (car (cdr outline)))))

(mapcar #'get-chapters-time outlinedois)
#+end_src

